package main

/*
	1	uint8
		无符号 8 位整型 (0 到 255)
	2	uint16
		无符号 16 位整型 (0 到 65535)
	3	uint32
		无符号 32 位整型 (0 到 4294967295)
	4	uint64
		无符号 64 位整型 (0 到 18446744073709551615)
	5	int8
		有符号 8 位整型 (-128 到 127)
	6	int16
		有符号 16 位整型 (-32768 到 32767)
	7	int32
		有符号 32 位整型 (-2147483648 到 2147483647)
	8	int64
		有符号 64 位整型 (-9223372036854775808 到 9223372036854775807)
	-------------------------------------------------------------------
	1	byte
		类似 uint8
	2	rune
		类似 int32
	3	uint
		32 或 64 位
	4	int
		与 uint 一样大小
	5	uintptr
		无符号整型，用于存放一个指针
*/
/*
	&i來獲取變數i的內存地址
*/
import (
	"fmt"
)

func main() {
	i := 1
	fmt.Println(&i)

}
